app/controllers/budgets_controller.rb

  def index
    @upcoming_budgets = Budget.upcoming_budgets
    @budgets = Budget.all
---
SELECT "budgets".* FROM "budgets"  WHERE (start_on > '2015-03-22')

    def set_budget
      @budget = Budget.find(params[:id])
---
SELECT  "budgets".* FROM "budgets"  WHERE "budgets"."id" = $1 LIMIT 1  [["id", 1]]